[
{"title": ["Sora: Creating video from text"]},
{"title": ["Uv: Python packaging in Rust"]},
{"title": ["Every Default macOS Wallpaper"]},
{"title": ["Building an LLM from Scratch: Automatic Differentiation"]},
{"title": ["PWAs wont replace native iOS apps"]},
{"title": ["Observable 2.0, a static site generator for data apps"]},
{"title": ["Sam Altman owns OpenAI's venture capital fund"]},
{"title": ["Safe and reliable production changes; and how Rivian recently got this wrong"]},
{"title": ["Launch HN: Zenfetch (YC W23) – Turn notes/browser history into an AI assistant"]},
{"title": ["Three Virtues of a Great Programmer"]},
{"title": ["Our next-generation model: Gemini 1.5"]},
{"title": ["Build your own 3D printed Hexapod"]},
{"title": ["Freenginx.org – open-source Nginx fork"]},
{"title": ["Finley (YC W21) Is a Fintech Hiring Software Engineers (US Remote)"]},
{"title": ["Apple confirms it's breaking iPhone web apps in the EU on purpose"]},
{"title": ["EncroChat"]},
{"title": ["Asahi Linux project's OpenGL support on Apple Silicon officially surpasses Apple"]},
{"title": ["Personality Trait Recognition Using ECG Spectrograms and Deep Learning"]},
{"title": ["Ask HN: Nitter officially declared \"over\" today – alternatives?"]},
{"title": ["When every ketchup but one went extinct (2022)"]},
{"title": ["Plastics producers deceived public about recycling, report reveals"]},
{"title": ["Stable pseudonyms create a more civil environment than real names: study (2021)"]},
{"title": ["A quantitative test of Diamond’s axis of orientation hypothesis"]},
{"title": ["Problem solving across 100,633 lines of code – Gemini 1.5 Pro Demo [video]"]},
{"title": ["Show HN: SlideCross – a combination of a crossword and Rubik's Cube"]},
{"title": ["Code Chores: The boring part of maintaining"]},
{"title": ["Ask HN: Are there any good reasons to use C++ over Rust for new projects today?"]},
{"title": ["Unreal Engine 5 ported to WebGPU"]},
{"title": ["The Fine Art of Baloney Detection [pdf]"]},
{"title": ["Artobiography: Two critics locate themselves in Netherlandish painting"]}
]